In [28]:
import pandas as pd
csv = pd.read_csv('./elements.csv')

In [29]:
csv.head()

       item_number    step_1    step_2    step_3  employee_id
0  4827635456-3601  1.203017  0.557463  3.683250         3601
1  4827635360-3601  5.222526  0.288862  0.970568         3601
2  4827635216-3601  0.558428  0.860152  1.867758         3601
3  4827635648-3601  3.682576  0.049501  1.186069         3601
4  4827635504-3601  1.157969  0.697663  0.269919         3601

In [30]:
csv.nunique()

item_number    2832010
step_1         2832010
step_2         2832010
step_3         2832010
employee_id       3912
dtype: int64

In [31]:
csv.isnull()

         item_number  step_1  step_2  step_3  employee_id
0              False   False   False   False        False
1              False   False   False   False        False
2              False   False   False   False        False
3              False   False   False   False        False
4              False   False   False   False        False
...              ...     ...     ...     ...          ...
2832005        False   False   False   False        False
2832006        False   False   False   False        False
2832007        False   False   False   False        False
2832008        False   False   False   False        False
2832009        False   False   False   False        False

[2832010 rows x 5 columns]

In [32]:
csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2832010 entries, 0 to 2832009
Data columns (total 5 columns):
 #   Column       Dtype
---  ------       -----
 0   item_number  object
 1   step_1       float64
 2   step_2       float64
 3   step_3       float64
 4   employee_id  int64
dtypes: float64(3), int64(1), object(1)
memory usage: 108.0+ MB

In [33]:
csv.describe()

             step_1        step_2        step_3   employee_id
count  2.832010e+06  2.832010e+06  2.832010e+06  2.832010e+06
mean   3.001129e+00  5.000888e-01  1.000362e+00  4.963259e+03
std    1.732657e+00  2.887325e-01  1.000092e+00  2.875815e+03
min    1.639755e-02  5.948118e-08  9.624561e-09  3.000000e+00
25%    1.728583e+00  2.500698e-01  2.880116e-01  2.499000e+03
50%    2.674836e+00  4.998611e-01  6.931661e-01  4.882000e+03
75%    3.922519e+00  7.501292e-01  1.386570e+00  7.453000e+03
max    2.172377e+01  9.999986e-01  1.514215e+01  9.998000e+03

In [34]:
csv_employees = pd.read_csv('./employees.csv')

In [35]:
csv_employees.head()

     id                name date_of_employment employment_type       team
0  3601   pani Bianka Ratka         2004-05-05      Pełen etat      Biały
1  5050    pani Bianka Jama         2018-09-30      Pełen etat   Czerwony
2  5767  Julian Gregorowicz         1992-12-05      Pełen etat     Czarny
3  6512   pani Justyna Rawa         1994-12-12       Pół etatu  Niebieski
4   192   pan Ksawery Daraż         2001-11-26      Pełen etat    Zielony

In [36]:
csv_employees.nunique()

id                    3912
name                  4985
date_of_employment    3992
employment_type          3
team                     5
dtype: int64

In [37]:
csv_employees.isnull()

         id   name  date_of_employment  employment_type   team
0     False  False               False            False  False
1     False  False               False            False  False
2     False  False               False            False  False
3     False  False               False            False  False
4     False  False               False            False  False
...     ...    ...                 ...              ...    ...
4995  False  False               False            False  False
4996  False  False               False            False  False
4997  False  False               False            False  False
4998  False  False               False            False  False
4999  False  False               False            False  False

[5000 rows x 5 columns]

In [38]:
csv_employees.describe()

                id
count  5000.000000
mean   4957.568800
std    2890.468906
min       3.000000
25%    2464.750000
50%    4870.000000
75%    7488.250000
max    9998.000000

In [39]:
csv_employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   id                  5000 non-null   int64
 1   name                5000 non-null   object
 2   date_of_employment  5000 non-null   object
 3   employment_type     5000 non-null   object
 4   team                5000 non-null   object
dtypes: int64(1), object(4)
memory usage: 195.4+ KB